<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"52d8f55563f4fdf8f94ec2ced68fd5d51809a75580cc290eb04ebb25607416cb","plan_job_ref":"Job Plan Airflow DAGs #155 at https://github.com/cal-itp/data-infra/actions/runs/16004548000","plan_out_hash":"765f9fdf666b7dc21133d6bf28e8f7682f4c8398211423d51756f43b566152a5","plan_hash":"ce657b2d246a40b48cdd459523423aba6d8af18efe13c1fa8ffb412f345860a7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 11 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_payment_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "K+YDLg==" -> (known after apply)
!~      detect_md5hash      = "Cw99qTY9/Dfp+wTpsAFhHQ==" -> "different hash"
!~      generation          = 1751385772591178 -> (known after apply)
        id                  = "calitp-staging-composer-dags/cosmos_payment_dag.py"
!~      md5hash             = "Cw99qTY9/Dfp+wTpsAFhHQ==" -> (known after apply)
        name                = "dags/cosmos_payment_dag.py"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "2Ay72w==" -> (known after apply)
!~      detect_md5hash      = "f7SR1eKDveuQSqSEB4mVGQ==" -> "different hash"
!~      generation          = 1751385772819525 -> (known after apply)
        id                  = "calitp-staging-composer-dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
!~      md5hash             = "f7SR1eKDveuQSqSEB4mVGQ==" -> (known after apply)
        name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "SY4sbQ==" -> (known after apply)
!~      detect_md5hash      = "T3AEV6PFDC02GmHmsLRANA==" -> "different hash"
!~      generation          = 1751385772587522 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "T3AEV6PFDC02GmHmsLRANA==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "8bBmlg==" -> (known after apply)
!~      detect_md5hash      = "I0vcrEgqNDY+n+mIBmOpXg==" -> "different hash"
!~      generation          = 1751385772586919 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_test.yml"
!~      md5hash             = "I0vcrEgqNDY+n+mIBmOpXg==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "6HEOIg==" -> (known after apply)
!~      detect_md5hash      = "3L+qE8MHq/NfKP1lMFBtfg==" -> "different hash"
!~      generation          = 1751385772863991 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "3L+qE8MHq/NfKP1lMFBtfg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "wXl05w==" -> (known after apply)
!~      detect_md5hash      = "WJKnCbI+6ke0lWUwiGP/yg==" -> "different hash"
!~      generation          = 1751385772900975 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      md5hash             = "WJKnCbI+6ke0lWUwiGP/yg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "fnjXaQ==" -> (known after apply)
!~      detect_md5hash      = "oKIimdFPnVixs06ULjWyjg==" -> "different hash"
!~      generation          = 1751385772593743 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      md5hash             = "oKIimdFPnVixs06ULjWyjg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "QBkRoA==" -> (known after apply)
!~      detect_md5hash      = "P9v530QDJXLHt/ITK9u5gQ==" -> "different hash"
!~      generation          = 1751385772893192 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      md5hash             = "P9v530QDJXLHt/ITK9u5gQ==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "LTFw0w==" -> (known after apply)
!~      detect_md5hash      = "gOWDzN7mlKRmbBnMEPmqsA==" -> "different hash"
!~      generation          = 1751385772924532 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      md5hash             = "gOWDzN7mlKRmbBnMEPmqsA==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "1m3oGQ==" -> (known after apply)
!~      detect_md5hash      = "m2l/l9jmJd550wsQpAbvXg==" -> "different hash"
!~      generation          = 1751385772943694 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      md5hash             = "m2l/l9jmJd550wsQpAbvXg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (20 unchanged attributes hidden)
    }

Plan: 0 to add, 11 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #155](https://github.com/cal-itp/data-infra/actions/runs/16004548000)